{"data":{"markdownRemark":{"html":"<h2>GDG 발표 후기</h2>\n<p>이번 참석에서 뜻깊은 점이 두 가지가 있다면 하나는 평소에 선망하던 개발자 분들을 만나볼 수 있는 자리였다는 점이고 다른 하나는 삼성역 3번 출구를 조금 지나서 만날 수 있는 오토웨이 타워에 방문했다는 점이다.  </p>\n<p>오토웨이 타워는 이년 전 삼성역에서 웹에이전시로 출퇴근하면서 지나치던 건물이었는데 이렇게 크고 멋진 공간에 드나드는 사람들은 어떤 사람들일까 항상 부럽고 궁금했었다. 그런데 2년이 지난 오늘 그렇게 바라만 보던 건물 정문으로 들어온 것은 꼭 목표를 이루어 나가는 과정처럼 느껴졌기 때문에 의미가 남달랐다.</p>\n<p>행사는 전체적으로 깨끗한 공간과 쾌적한 환경에서 이루어져서 만족스러웠다. 특히, 스태프분들이 친절하고 많이 계셔서 바로 도움을 받을 수 있는 점도 좋았다. 그리고 이번 행사의 큰 재미였던 인피니티 스톤을 다 모으는 데는 안타깝게 실패했지만, 다른 평행 우주에서 해결하도록 하겠다.</p>\n<p>아래부터는 오늘 발표에 대한 개인 감상이다.</p>\n<h3>천민호님</h3>\n<hr>\n<p>앵귤러는 어렵다는 선입견이 있어서 가까이하고 싶은 생각이 들지 않았는데, 왜 필요한지에 대한 배경 설명을 듣다 보니 앞으로 공부하고 싶다는 마음이 생겼다. 앵귤러는 지금 내가 겪고 있는 일종의 방목된 개발 환경을 프레임워크라는 하나의 틀 안에서 강제함으로써 얻어지는 이익이 있다고 말한다. 자바스크립트는 동적 언어인데 왜 타입스크립트로 자료형을 강제하는지에 대한 설명도 이해에 많은 도움이 되었다. 사전에 정의된 많은 약속은 일정 규모 이상에서 효율성을 가져온다.</p>\n<h3>한재엽님</h3>\n<hr>\n<p>프론트엔드 개발자는 단순히 화면을 구현하는 것만이 아니라, 디자이너와 프론트엔드 사이의 가교 역할을 하면서 UX 엔지니어링 포용할 수 있어야 한다로 재해석하며 들었다. 세션은 크게 성능 최적화, 예상 가능한 동작을 통한 UX 환경 구축, SEO/SMO, 측정과 개선으로 나누어졌고 앞으로 프론트엔드 기술을 향상하기 위해서 어떤 관점으로 접근하면 좋을지 방향과 해답을 찾을 수 있었다. 무엇보다 이번 발표자분들 모두 훌륭하고 멋있었지만 마지막 Q&#x26;A 패널 토크까지 포함해서 한재엽님 대화법이 가장 부드럽고 편안했다고 느껴졌다. 협업하기 좋은 동료란 어떤 모습일까에 대한 많은 참고가 됐다.</p>\n<h3>서재원님</h3>\n<hr>\n<p>모나드라는 키워드가 나왔다. 대체로 이해 범위를 넘어가는 부분이 많아서 난이도가 높았던 것 같다. 당분간은 Functional Reactive Programming(함수형 반응형 프로그래밍)은 비동기 데이터 스트림을 이용한 프로그래밍이다 정도로만 이해해야 될 것 같다. 유인동님의 동강인, 함수형 프로그래밍을 수강하지 않았다면 무슨 내용인지 전혀 감을 잡지 못할 뻔했다. 발표를 시작하면서 중학생이라고 소개하셔서 놀랐는데 조금 아쉬웠던 부분은 청자가 실제로 기술이 대한 이해가 부족하더라도 그것을 지나치게 의식하면서 발표하지 않았다면 더 좋지 않았을까 생각해 보았다. 어쨌든 나는 프로그래밍에 사회적 지위, 배경, 나이, 성별 등을 뛰어넘는 힘이 있다고 생각하는데 서재원 님을 보면서 다시금 느낄 수 있어서 좋았다.</p>\n<h3>안희종님</h3>\n<hr>\n<p>개발자로 성장하기 위해서는 어떤 태도를 가져야 하는지 경험과 노하우를 공유해주신 발표 중에 가장 공감하며 들었던 부분은 결과에 대한 회고와 가정에 대한 평가이다. 측정할 수 있으면 경영할 수 있다는 말처럼 어떤 행동에 대한 평가는 성장에 중요한 요인으로 보인다. 앞으로 단순히 경험을 소비하는 형태가 아니라, 평가를 통해 방향을 설정할 수 있어야겠다. 그리고 Minimum viable product(최소로 실행 가능한 제품)을 통한 개발 접근법에 대한 설명도 많은 공부가 됐다.</p>\n<h3>한근택님</h3>\n<hr>\n<p>프론트엔드 개발자로 커리어를 전환하신 이야기를 감칠 나게 해주셔서 정말 재밌게 들었다. 자신의 방향성과 맞지 않은 환경은 과감히 거절하고, 소신있게 나아가는 모습도 멋졌다. 집에 돌아오는 길에 좋은 환경이 불러오는 선순환에 대해서 많은 고민을 하게 됐다. 한근택님은 전직을 위해서 크게 두 번의 공부 기간을 거쳤다고 했다. 유머스럽고 재치 있는 캐릭터 뒤에는 변화를 위한 치열한 노력이 있었음을 기억하자.</p>\n<h3>나석주님</h3>\n<hr>\n<p>앵귤러에 대한 기술 중심의 발표를 해주셨다. 앵귤러를 한 번도 접해보지 않은 나로서는 역량을 넘어서는 섹션이었지만, 화면으로 잠깐 보여주신 토스 카드 페이지의 트랜지션 부분은 꽤 흥미로웠다. 폭죽이 터지거나 카드가 기울어지는 모션은 어떻게 구현되어 있을까 작동 원리가 궁금했고 직접 구현해 보고 싶은 도전 욕구와 호기심을 자극했다. 그리고 Dependency Injection(의존성 주입)이라는 디자인 패턴에 대해서 인지할 수 있는 계기가 됐다. 무엇보다 트위터 하시는지 궁금하다.</p>\n<h3>김민준님</h3>\n<hr>\n<p>우리 스터디에서 가장 많이 참고하는 책과 포스트를 작성하신 분을 현장에서 보게 되니 묘한 생동감이 있었다. 발표 시작에 자신은 이렇게 경험해서 이런 결과를 도출했는데 나중에는 생각이 달라져서 수정할 수 있다고 말씀해 주신 덕분에 수동적으로 강좌만 따라 할 것이 아니라, 무엇이 더 좋을지 같이 생각해 보는 태도로 확장해서 청강할 수 있었다. 특히, 컴포넌트 스타일링에서 'classnames 라이브러리'보다 좋은 접근법을 찾기 위해서 고민했던 부분은 충분히 공감하면서 들었다. 짧은 시간이였지만 압축된 경험을 잘 전달해 주셔서 여러모로 좋았다.</p>","frontmatter":{"title":"GDG FRONT-ENDGAME 　컨퍼런스 후기","tags":["후기","2019","GDG"],"date":"23 June, 2019"},"headings":[{"value":"GDG 발표 후기","depth":2},{"value":"천민호님","depth":3},{"value":"한재엽님","depth":3},{"value":"서재원님","depth":3},{"value":"안희종님","depth":3},{"value":"한근택님","depth":3},{"value":"나석주님","depth":3},{"value":"김민준님","depth":3}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2019/06/23/note/","prev":null,"next":{"node":{"headings":[{"value":"업무"},{"value":"개인 프로젝트"},{"value":"활동"},{"value":"잃어버린 것들 되찾기"}],"fields":{"slug":"/2019/05/19/note/"},"frontmatter":{"title":"성장 회고","tags":["회고","2019"]}}}}}