{"data":{"markdownRemark":{"html":"<p>글을 시작하기까지 무슨 말을 해야 할지 그리고 할 수 있을지 많은 고민이 있었다. 다른 개발자들의 성장 후기나 회고를 읽고 있으면 내가 작게만 느껴졌기 때문이다.</p>\n<p>그렇게 자신을 의심하고 있을 때 예전 기억이 떠올랐다. 개발자로 업무를 시작하면서 한참 자신의 정체성에 대해 고민하고 있을 시기였는데 내가 정말 프론트엔드 개발자가 맞냐고 친구에게 질문을 하게 됐다.</p>\n<p>백엔드 개발자이자 한 회사에 과장으로 있는 친구는 고맙게도 넌 프론트엔드 개발자가 맞다고 대답해줬다. 당시에 친구의 한 마디에 용기를 얻어 나아갈 수 있었는데 한편으로는 정말로 나의 정체성을 부여하는 것은 누구인가? 라는 생각을 하게됐다. 스스로 자신을 정의하지 못한다면 누가 대신해줄 수 있을까 :)</p>\n<p>내가 좋아하는 알렉상드로 뒤마의 소설인 &#x3C;몬테크리스토 백작(암굴왕)>에서는 '에드몽 당테스'라는 주인공이 나온다. 촉망받는 일등 항해사이자 아름다운 여인인 메르세데스와 약혼한 청년으로 앞날이 창창했지만, 믿었던 가장 친한 친구에게 배신을 당하고 범죄자와 정치범을 수용하는 악명 높은 이프 섬에 갇히게 된다. 그렇게 감옥에서 14년간 모진 고문을 당하고 아무 희망도 없을 것 같았던 그곳에서 신비로운 의인을 만나 성장하고 끝내는 탈출해서 복수를 이룬다는 이야기를 그리고 있다.</p>\n<p>이 소설에서는 “God will give me justice.”라는 문구나 나오는 데 어려운 환경 속에서도 포기하지 않고 끊임없이 노력하면 자신이 원하는 것을 하늘이 돕는다는 믿음을 내포하고 있다.</p>\n<p>나도 이처럼 실패에 굴하지 않고 개발자가 되려고 노력했던 지난 시간을 기록으로 남기려고 한다. 부족한 모습을 보이려니 부끄럽지만 내가 어려웠던 시절 누군가의 글이 내게 힘이 되었듯이 나의 기록도 누군가에게 힘이 될 수 있기를 바라며 조심스럽게 시작해 본다.</p>\n<h2>웹 퍼블리셔에서 개발자로 성장하기</h2>\n<h3>개발을 시작하게된 계기</h3>\n<hr>\n<p>20대 초에 일찍 사회생활을 시작하다 보니 전문성이 부족해서 좋은 일자리가 잘 주어지지 않았다. 그러다 보니 방황도 많았던 것 같은데 막연한 동경에 지나지 않았던 프로그래밍을 시작하게 된 계기는 운영하던 사업체를 정리하면서다.</p>\n<p>서른살의 초입에서 과연 나는 이대로 괜찮은가 고민했다. 그리고는 내가 마지막으로 눈을 감는 순간을 상상하며 의미 있고 즐거운 생이였다고 말할 수 있을까 자문하게 되었다. 답은 그렇지 않았다. 그래서 지금까지 불가능하다고 믿었던 어릴 적 꿈을 반드시 이루자고 결심했다. 그렇게 개발이 무엇인지 아무것도 모르는 상태에서 의지만을 가지고 출발했다.</p>\n<h3>배움의 과정</h3>\n<hr>\n<p>프로그래밍을 어떻게 시작하면 좋을지 몰라서 고용노동센터에서 상담을 받았다. 웹 개발을 가르치는 학원이 있다고 해서 당시 여러 학원을 방문해 보았는데 커리큘럼과 학원 분위기 등을 확인해 보고 강남 소재의 학원으로 결정하게 되었다.</p>\n<p>당시에는 프론트엔드/백엔드의 개념을 몰랐기 때문에 홈페이지를 만드는 과정이라고 설명을 들어서 다 똑같은 웹 개발자 코스인 줄 알았다. 😇 어째서인지 찾아간 학원마다 웹 퍼블리싱 과정만을 소개해 줬던 이유도 컸다. 나중에 알고 보니 마크업 개발자(웹 퍼블리셔)는 개발자가 아니라는 사회의 시선과 차별이 있어서 힘들었다. 다 똑같이 웹 서비스를 개발하는데 왜 아닐까? 그럼 게임 회사의 기획자나 그래픽 아티스트는 게임 개발자가 아닌가? 하고 의문을 가지게 됐다.</p>\n<p>어쨌든 국비지원학원에서 약 5개월간 웹 퍼블리싱에 필요한 기술을 배우기 시작했다. 일러스트, 포토샵, HTML, CSS, Javascript, jQuery 등등. 다행히 선생님께서 전공자분이셨고 교육대학원을 나오셨기 때문에 정말 운이 좋았다고 할 수 있는데. 요즘 학원 시장이 국가에서 나오는 지원금을 타려고 충분히 검증되지 않은 사람을 강사로 내세우고 있기 때문에 문제가 많다고 한다. 그런 이유에서 짧은 시간 동안 최대한 배워도 모자라는데 저런 환경이 복합적으로 작용하다 보니 학원 출신 개발자에 대한 인식이 좋지 않았던 것으로 보인다.</p>\n<p>수업 참여는 적극적으로 했다. 한 번은 선생님이 그래픽기술 1급 자격증 시험이 있다고 초등학생도 보러 가는 쉬운 시험이라고 소개해 주셔서 철석같이 그것만 믿고서 가벼운 마음으로 시험 준비를 했는데. 웬걸 시험장 도착해서 보니 초등학생은 안 보이고, 성인들이 컴퓨터 앞에 앉아서 자로 이미지 위치를 재가면서 치열하게 시험을 보고 있었다. 😭</p>\n<p>알고 보니 디자인 전공자였던 같은 반 학생이 말하기를 자기 학교 학생들도 간혹 1급에서 떨어진다고 알려주었다.. 어쨌거나 준비는 진지하게 했기 때문에 생각보다 높은 점수로 통과할 수 있었다.</p>\n<p>이때 자신감이 좀 붙었다. 서른이 넘는 나이에 무언가 새롭게 시작하려다 보니 어린 친구들 사이에서 걱정이 되었는데. 정말 광고문구 그대로 “나이는 숫자에 불과하구나.”하고는 순진하게 생각했다.</p>\n<p>플라시보 효과였을까? 잘할 수 있다고 믿으니 공부 성과도 나름대로 괜찮았다. 배너 슬라이드를 jQuery + HTML + CSS로 제작하는 일종의 중간 테스트가 있었는데. 하나 다 만들고 말씀드렸더니 벌써 다 했냐며 하나 더 주시더라. 그래서 하나 더 만들고 복도에 나가서 물도 마시고 화장실도 갔다 왔는데도 다들 첫 번째 문제에서 분투하고 있었다.</p>\n<p>이 이야기를 지인에게 했더니 재수 없다고 놀림을 받았다. 그렇지만 욕을 먹고서도 왠지 기분이 좋은 건 참을 수 없었다. 😇 나의 노력이 조금은 통한 것 같았기 때문이다.</p>\n<p>그런 시간이 지나자 선생님이 안 계실 때는 고맙게도 주변 학생들이 내게 도움을 요청하기 시작했다. 여러 케이스를 살펴보면서 같이 기능 구현도 해보고 가르쳐 주면서 스스로 많이 배울 수 있었다.</p>\n<h3>명과 암</h3>\n<hr>\n<p>그렇지만 세상은 이렇게 서로의 부족함을 돕는 온정 속에서도 차가운 이면도 존재했다.</p>\n<p>요즘 넷플릭스에서 &#x3C;우리의 지구>라는 네셔널지오그래픽의 다큐멘터리를 보고 있는데, 여기서 아프리카 탕가니카호에 사는 '칼립테루스 시클리드'라는 물고기가 소개된다.</p>\n<p>커다란 조개껍데기를 모아서 각자의 공간을 꾸며서 암컷을 유혹하는데 어떤 한 마리의 물고기가 다른 물고기가 자리를 비우면 그 조개를 훔쳐서 자신의 공간을 꾸미는 것이었다.</p>\n<p>내 뒤에 앉았던 학생이 그랬다. 어느 날 보니 포트폴리오 레이아웃을 내 것과 똑같이 만들고 있었다. 그동안 뒤에서 내 화면을 보면서 똑같이 만들고 있었던 것이었다. 너무 황당해서 할 말을 잃었다.</p>\n<p>하지만 문제는 여기서 끝나지 않았다. 선생님께서 수업 중간에 포폴이 반에서 제일 잘 나왔다고 칭찬해 주셔서 수료하면 어느 정도 괜찮은 회사에 입사할 기회가 있을 줄 알았지만, 나를 반기는 회사는 그렇게 많지 않았다.</p>\n<p>그 와중에 나와 또래인 여학생은 퍼블리싱에 어려움을 겪고 있었지만 누가 들어도 좋은 복지가 있는 큰 회사로 입사했다. 그 와중에 내 뒷자리의 학생도 먼저 취업했다는 이야기를 전해 들었다. 나는 무엇이 부족한가? 자신만만했던 나는 없어지고 자괴감만이 남았다.</p>\n<p>그렇지만 포기할 수는 없었다. 학원을 수료하고 나서 3개월 정도 따로 취업 준비를 했다. 이때 정말 외로웠다. 온종일 공부하고 자소서 쓰고 포트폴리오를 새로 만들면서 면접을 보러 다녔다. 그렇게 하는데도 잘 안돼서 기관의 도움을 받기로 했다.</p>\n<p>결국 상담사분이 소개해 주신 여러 업체 중에 하나에서 일을 시작하게 됐는데 스타트업이라는 보기 좋은 허울에서 사업 놀이를 하는 회사였다.</p>\n<p>처음 입사할 때 처우 협상한 부분이 대부분 거짓이었다. 한 번은 컴퓨터가 아직 준비되지 않았으니 개인 노트북을 잠시 사용해 달라고 해서 알겠다고 했는데 너무 늦어지는 것 같아서 물어봤더니 실제로는 구매할 생각이 처음부터 없었다. 😡</p>\n<p>다음은 에이전시로 발걸음을 옮겼다. 물론 이 회사도 정상적인 곳은 아니었다. 출근 첫날 밤 11시가 넘어서 퇴근했다. 집과의 거리가 있기 때문에 그만 전철을 타러 가야 한다고 말했더니 먼저 들어온 같은 나이의 동기가 무슨 말이냐며 못가게 앞을 막아섰다.</p>\n<p>나는 그런 회사를 꾹 참고 다녔다. 회사도 문제가 많았지만 이런 환경이 자꾸만 찾아온다는 것은 나 자신에게도 문제가 있음을 역설한다. 그렇기에 부족함을 극복하기 위해서 주어진 환경에서 최선을 다하며 또다시 이직 준비를 했다.</p>\n<h3>그릿(GRIT)</h3>\n<hr>\n<p>그렇게 조금씩 모은 경험치로 국가 프로젝트를 진행하는 회사에 어렵게 입사할 수 있었다.</p>\n<p>이전 회사들보다 나았던 점은 최소한 팀에 십년 차 이상의 개발 팀장급 인원이 있다는 이야기를 들을 수 있었고 회사의 규모도 중견 정도는 되어 보였다. 일단은 팀 규모가 지금까지 겪은 곳들과는 다르게 좀 컸다.</p>\n<p>기술적으로 아쉬운 부분은 우리 회사는 웹 서비스를 개발하는 회사가 아니었고, HTML, CSS, Javascript(~ES5)을 활용해서 디지털 콘텐츠를 제작하는 회사라는 점이다. 다만 기술의 본질이 다른 것은 아니라고 생각했기 때문에 부족한 점은 외부에서 채우고 내부에서는 근원인 언어를 공부하기로 결정했다.</p>\n<p>그런데 사실 큰 문제가 없을 것 같은 우리 회사는 하청의 하청으로 월차도 없이 일해야 하는 곳이었고 야근도 잦아서 근무 환경이 매우 열악했다. 나중에 알고 보니 개발 팀장급으로 계시는 분도 사실은 스크립트를 잘 모르셨다.</p>\n<p>정말 이때부터 절박한 심정으로 삶의 전반을 바꾸기 위해서 치열하게 노력했다. 주말에 세미나에 다니고, 스터디에 나갔다. 팀장님이 거의 마크업 개발만 하시고 회사를 금방 옮기셨기 때문에 누군가 가르쳐주는 사람이 없어서 책과 인터넷을 참고하며 공부했다. 보통 출퇴근 시간에 세 시간 정도를 사용했는데 시간이 아까워서 전철 탈 때 꼭 책을 챙겼다.</p>\n<p>처음에는 공부한 내용이 전혀 이해되지 않았지만, 시간이 점차 흐르자 고승덕 변호사의 &#x3C;콩나물 공부법>처럼 조금씩 성과가 있었다. 본격적으로 개발 업무를 시작한 것은 스크립트 개발을 지원하러 온 경력 개발자들의 소스 코드가 클라이언트의 요구 사항이 변경될 때 너무 많은 자원을 필요로 하는 것을 느끼고부터이다.</p>\n<p>그것은 핵심 기능이 프로토타입의 상속을 통해 구현되지 않아서 하나의 객체가 너무 많은 상태를 관리했고 내부 함수도 많은 일을 한 번에 처리하고 있어서 코드의 재사용성이 현저히 낮아서 발생한 문제였다. 더군다나 정해진 코드 컨벤션이 없었기 때문에 가독성 또한 좋지 못했는데 이런 부분을 리펙토링하면서 조금씩 실력을 키워나갔다.</p>\n<p>또 다른 문제로는 플레인(바닐라) 자바스크립트가 아닌 제이쿼리로 여기저기 붙여서 구현되어 간단한 드래그 기능에서도 퍼포먼스 문제를 발생시켰다. 여기에 자체적으로 개발 가능한 부분까지 외부 라이브러리에 필요 이상으로 의존하고 있어서 여러 이슈에 유연하게 대처하는 데 문제가 많았다고 볼 수 있었다.</p>\n<p>당시 나는 마크업 개발자(웹 퍼블리셔)로 외주 개발자분이 도저히 못 만들겠다는 기능을 대신 구현하면서 그동안 공부한 것이 있으니 이제 개발자로 전직을 하겠다고 회사에 말씀드리고 그에 알맞은 타이틀과 처우를 달라고 딜을 했다.</p>\n<p>회사는 추가적 다른 개발자분들이 수정하지 못한 레거시 코드를 내가 보수한 이후에 큰 오류 없이 동작하는 것을 지켜보고는 향후 새로운 개발 물을 전임으로 맡으라는 조건으로 개발자 타이틀을 내어 주었다.</p>\n<p>이 소식을 듣고 정말 뛸 뜻이 기뻤다! <strong>입사하고 육개월 만에 눈물로 이룬 성과였다.</strong></p>\n<p>지금은 시간이 흐르고 지금은 프론트엔드 개발자로 이직 준비 중이다. 예전에는 무엇을 공부해야 하는지 모르는 상태였다면 이제는 무엇을 공부해야 하는지 조금은 알게 된 것 같다. 물론 모르는 부분이 훨씬 더 크지만 그건 앞으로 또 배워나가면 된다 :)</p>","frontmatter":{"title":"개발자로 성장하기까지의 지난 2년의 기록","tags":["기록","에세이","2019"],"date":"16 May, 2019"},"headings":[{"value":"웹 퍼블리셔에서 개발자로 성장하기","depth":2},{"value":"개발을 시작하게된 계기","depth":3},{"value":"배움의 과정","depth":3},{"value":"명과 암","depth":3},{"value":"그릿(GRIT)","depth":3}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2019/05/16/note/","prev":{"node":{"headings":[{"value":"업무"},{"value":"개인 프로젝트"},{"value":"활동"},{"value":"잃어버린 것들 되찾기"}],"fields":{"slug":"/2019/05/19/note/"},"frontmatter":{"title":"성장 회고","tags":["회고","2019"]}}},"next":null}}